<script>
    // 下載檔案資料
    const files = [
        {
            title: '資訊工程學系校外實習申請書',
            source: 'https://cs.ntcu.edu.tw/file/740'
        },
        {
            title: '國立臺中教育大學資訊工程學系學生參加校外資訊競賽補助要點(110.03.11通過)',
            source: 'https://cs.ntcu.edu.tw/file/633'
        },
        {
            title: '資訊工程學系學生參加校外資訊競賽補助申請表',
            source: 'https://cs.ntcu.edu.tw/file/632'
        },
        {
            title: '國立臺中教育大學資訊工程學系獎學金要點',
            source: 'https://cs.ntcu.edu.tw/file/375'
        },
    ]

    // 下載檔案資料
    const qaData = [
        {
            question: '如果我沒有電腦基礎，可以讀資工嗎？',
            answer: '資訊工程學的主要是電腦的理論，和電腦的應用沒有直接關聯，就算沒有電腦基礎，一樣能適應良好。最重要的是要對電腦有興趣，不排斥電腦，那資訊一定是你的最佳選擇。',
            type: '一般問題'
        },
        {
            question: '讀資工，我未來有什麼進修管道呢？',
            answer: `可就讀國內外資訊工程、資訊科學、資訊網路、軟體工程、多媒體、通訊工程、電機工程、資訊教育、數位內容與資訊管理等相關研究所之碩博士班。

                    本系歷屆大學部畢業生大多繼續進入研究所深造，主要就讀系所包括臺大、交大、清大、成大、中央、中興、中山、中正、臺科大等以及本校資訊工程相關研究所。近年考取國立大學研究所比例如下：103學年度45.10%、104學年度58.54%、105學年度56.10%。106學年度截至更新資料期限為止尚在統計中。`,
            type: '修課問題'
        },
    ] 

</script>
<h1>123</h1>